{
    "instagram":{
        "id": "instagram",
        "photo": "assets/ig.jpg",
        "title": "Instagram",
        "content": "Instagram is an image and video sharing based social networking platform that was launched in October 2010 by creators Kevin Systrom and Mike Krieger. It is currently owned by Facebook and had achieved one billion monthly active users in 2018. Instagram's main features include posts that allow extensive engagement, direct messaging, stories, along with newer features such as reels and IGTV. Because the platform mainly caters to public sharing, businesses and influencers can utilize the Promotions and Insights tools to grow and market their brands, as well as make their posts shoppable. The majority of Instagram's users land within the age range of 18-34, making it an ideal place for marketing; however, revenue is limited due to the platform's mobile-only nature. The mega-social networking service's wide accessibility to the public also entails a decline in mental health through cyberbullying, depression, body image issues, etc. Instagram has since implemented various user abilities, such as private accounts and automatic filters for inappropriate comments, to counter abusive usage."
    },
    "snapchat":{
        "id": "snapchat",
        "photo": "assets/sc.svg",
        "title": "Snapchat",
        "content": "Snapchat is a social media messaging application that is primarily known for its vanishing feature for messages and photos. It was developed by Snap Inc. and released in September 2011, roughly a year after Instagram. In February 2021, Snapchat achieved over 100 million monthly active users. The platform revolves mostly around private communication and includes features that encourage messaging such as best friend emojis, streaks, and Snapchat scores and trophies. Additionally, users are allowed to save their personal photos into a space that imitates a photo album, which also includes features like Memories and Month Recap that personalizes the app. This direction towards more casual, everyday content inevitably attracts a smaller, younger audience, most notably teenagers. Public interaction is limited but sponsored stories are available in the Discover section, along with news and entertainment stories, and a recently added feature, named Spotlight, serves as a public forum where users can upload videos."
    },
    "comparecontrast":[
        {
            "title": "Instagram",
            "items": ["Photo sharing", "Direct messaging (vanish mode)", "24-hour stories", "Live broadcasts", "Explore page", "Reels (includes TikTok uploads", "IGTV", "Mobile-use optimization", "Private account setting", "Close friends list"]
        },
        {
            "title": "Snapchat",
            "items": ["Vanishing photos and messages", "24-hour stories", "Streaks with friends", "Discover section", "Spotlight section (includes TikTok uploads)", "SnapMap", "Annual memories and month recap", "Mobile-use only", "Private story", "Best friends list"]
        }
    ],
    "conclusion": {
        "id": "conclusion",
        "title": "Conclusion",
        "photo": "assets/pretty.jpg",
        "content": "Though the size and range of their users significantly differ, both Instagram and Snapchat share many similar features as two social networking services focusing on visual content. The most prominent and deciding difference between these two platforms is the usage of the app that caters to a certain audience. As a public platform where users can easily see each others users' content and profiles, Instagram is a place for entertainment and professionalism, on top of massive social networking. On the other hand, Snapchat focuses on social networking primarily through multimedia messaging, which limits a variety of usages, but even still, maintains a stable, growing audience. The application is more personal and private, as it primarily involves communication of daily life content."
    }
}
